#### Terraform Format 🖌 `failure`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=job-match-v0/bigquery.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=job-match-v0/iam.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=job-match-v0/iamcredentials.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=job-match-v0/compute.googleapis.com]
google_service_account.deploy: Refreshing state... [id=projects/job-match-v0/serviceAccounts/deploy-sa@job-match-v0.iam.gserviceaccount.com]
google_service_account.terraform: Refreshing state... [id=projects/job-match-v0/serviceAccounts/terraform-sa@job-match-v0.iam.gserviceaccount.com]
data.google_compute_zones.available: Reading...
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=job-match-v0/cloudresourcemanager.googleapis.com]
google_service_account.vm: Refreshing state... [id=projects/job-match-v0/serviceAccounts/jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
data.google_project.current: Reading...
google_project_service.apis["storage.googleapis.com"]: Refreshing state... [id=job-match-v0/storage.googleapis.com]
google_project_iam_member.deploy_os_login: Refreshing state... [id=job-match-v0/roles/compute.osLogin/serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com]
google_project_iam_member.deploy_compute_admin: Refreshing state... [id=job-match-v0/roles/compute.instanceAdmin.v1/serviceAccount:deploy-sa@job-match-v0.iam.gserviceaccount.com]
data.google_project.current: Read complete after 0s [id=projects/job-match-v0]
google_project_iam_member.terraform_storage_admin: Refreshing state... [id=job-match-v0/roles/storage.admin/serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com]
data.google_compute_zones.available: Read complete after 0s [id=projects/job-match-v0/regions/europe-west9]
google_project_iam_member.terraform_editor: Refreshing state... [id=job-match-v0/roles/editor/serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_user: Refreshing state... [id=job-match-v0/roles/iam.serviceAccountUser/serviceAccount:terraform-sa@job-match-v0.iam.gserviceaccount.com]
google_project_iam_member.vm_logging_writer: Refreshing state... [id=job-match-v0/roles/logging.logWriter/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_project_iam_member.vm_bigquery_job_user: Refreshing state... [id=job-match-v0/roles/bigquery.jobUser/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_project_iam_member.vm_monitoring_writer: Refreshing state... [id=job-match-v0/roles/monitoring.metricWriter/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_compute_address.static: Refreshing state... [id=projects/job-match-v0/regions/europe-west1/addresses/jobmatch-static-ip]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/job-match-v0/locations/global/workloadIdentityPools/github-pool]
google_compute_network.main: Refreshing state... [id=projects/job-match-v0/global/networks/jobmatch-vpc]
google_bigquery_dataset.silver: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver]
google_bigquery_dataset.gold: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_gold]
google_storage_bucket.bronze: Refreshing state... [id=jobmatch-bronze-job-match-v0]
google_storage_bucket.backups: Refreshing state... [id=jobmatch-backups-job-match-v0]
google_service_account_iam_member.terraform_workload_identity: Refreshing state... [id=projects/job-match-v0/serviceAccounts/terraform-sa@job-match-v0.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/323309663680/locations/global/workloadIdentityPools/github-pool/attribute.repository/MatthieuEngles/jobmatch]
google_service_account_iam_member.deploy_workload_identity: Refreshing state... [id=projects/job-match-v0/serviceAccounts/deploy-sa@job-match-v0.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/323309663680/locations/global/workloadIdentityPools/github-pool/attribute.repository/MatthieuEngles/jobmatch]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/job-match-v0/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-icmp]
google_compute_firewall.allow_https: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-https]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-internal]
google_compute_subnetwork.main: Refreshing state... [id=projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet]
google_compute_firewall.allow_http: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-http]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/job-match-v0/global/firewalls/jobmatch-vpc-allow-ssh]
google_bigquery_table.offer_languages: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver/tables/offer_languages]
google_bigquery_table.offer_formations: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver/tables/offer_formations]
google_bigquery_table.offers: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver/tables/offers]
google_bigquery_table.offer_skills: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver/tables/offer_skills]
google_bigquery_dataset_iam_member.vm_silver_editor: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_silver/roles/bigquery.dataEditor/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_bigquery_dataset_iam_member.vm_gold_editor: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_gold/roles/bigquery.dataEditor/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_bigquery_table.skills_ranking: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_gold/tables/skills_ranking]
google_bigquery_table.offers_daily_stats: Refreshing state... [id=projects/job-match-v0/datasets/jobmatch_gold/tables/offers_daily_stats]
google_storage_bucket_iam_member.vm_bronze_admin: Refreshing state... [id=b/jobmatch-bronze-job-match-v0/roles/storage.objectAdmin/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_storage_bucket_iam_member.vm_backups_admin: Refreshing state... [id=b/jobmatch-backups-job-match-v0/roles/storage.objectAdmin/serviceAccount:jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com]
google_compute_instance.main: Refreshing state... [id=projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_bigquery_dataset.gold must be replaced
-/+ resource "google_bigquery_dataset" "gold" {
      ~ creation_time                   = 1767020627022 -> (known after apply)
      + default_collation               = (known after apply)
      - default_partition_expiration_ms = 0 -> null
      - default_table_expiration_ms     = 0 -> null
      ~ etag                            = "r7XV/Y6HyCxUWiziyVOYmQ==" -> (known after apply)
      ~ id                              = "projects/job-match-v0/datasets/jobmatch_gold" -> (known after apply)
      ~ is_case_insensitive             = false -> (known after apply)
      ~ last_modified_time              = 1767020710007 -> (known after apply)
      ~ location                        = "europe-west1" -> "europe-west9" # forces replacement
      ~ max_time_travel_hours           = "168" -> (known after apply)
      - resource_tags                   = {} -> null
      ~ self_link                       = "https://bigquery.googleapis.com/bigquery/v2/projects/job-match-v0/datasets/jobmatch_gold" -> (known after apply)
      + storage_billing_model           = (known after apply)
        # (7 unchanged attributes hidden)

      - access {
          - role          = "OWNER" -> null
          - user_by_email = "matthieu@molp.tech" -> null
        }
      - access {
          - role          = "OWNER" -> null
          - special_group = "projectOwners" -> null
        }
      - access {
          - role          = "READER" -> null
          - special_group = "projectReaders" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - user_by_email = "jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - special_group = "projectWriters" -> null
        }
    }

  # google_bigquery_dataset.silver must be replaced
-/+ resource "google_bigquery_dataset" "silver" {
      ~ creation_time                   = 1767020627019 -> (known after apply)
      + default_collation               = (known after apply)
      - default_partition_expiration_ms = 0 -> null
      - default_table_expiration_ms     = 0 -> null
      ~ etag                            = "/KxcAcuxBD4CzzWMFsRNxg==" -> (known after apply)
      ~ id                              = "projects/job-match-v0/datasets/jobmatch_silver" -> (known after apply)
      ~ is_case_insensitive             = false -> (known after apply)
      ~ last_modified_time              = 1767020628406 -> (known after apply)
      ~ location                        = "europe-west1" -> "europe-west9" # forces replacement
      ~ max_time_travel_hours           = "168" -> (known after apply)
      - resource_tags                   = {} -> null
      ~ self_link                       = "https://bigquery.googleapis.com/bigquery/v2/projects/job-match-v0/datasets/jobmatch_silver" -> (known after apply)
      + storage_billing_model           = (known after apply)
        # (7 unchanged attributes hidden)

      - access {
          - role          = "OWNER" -> null
          - user_by_email = "matthieu@molp.tech" -> null
        }
      - access {
          - role          = "OWNER" -> null
          - special_group = "projectOwners" -> null
        }
      - access {
          - role          = "READER" -> null
          - special_group = "projectReaders" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - user_by_email = "jobmatch-vm-sa@job-match-v0.iam.gserviceaccount.com" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - special_group = "projectWriters" -> null
        }
    }

  # google_compute_address.static must be replaced
-/+ resource "google_compute_address" "static" {
      ~ address            = "34.140.169.214" -> (known after apply)
      ~ creation_timestamp = "2025-12-29T07:00:02.910-08:00" -> (known after apply)
      ~ effective_labels   = {} -> (known after apply)
      ~ id                 = "projects/job-match-v0/regions/europe-west1/addresses/jobmatch-static-ip" -> (known after apply)
      ~ label_fingerprint  = "42WmSpB8rSM=" -> (known after apply)
      - labels             = {} -> null
        name               = "jobmatch-static-ip"
      ~ prefix_length      = 0 -> (known after apply)
      + purpose            = (known after apply)
      ~ region             = "europe-west1" -> "europe-west9" # forces replacement
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/job-match-v0/regions/europe-west1/addresses/jobmatch-static-ip" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ terraform_labels   = {} -> (known after apply)
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_compute_instance.main must be replaced
-/+ resource "google_compute_instance" "main" {
      ~ cpu_platform              = "Intel Broadwell" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm" -> (known after apply)
      ~ instance_id               = "4169732323387844991" -> (known after apply)
      ~ label_fingerprint         = "4gdcAoucCFs=" -> (known after apply)
      ~ machine_type              = "e2-standard-2" -> "e2-medium"
      ~ metadata_fingerprint      = "YVuzyuAQUXk=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "jobmatch-vm"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/job-match-v0/zones/europe-west1-b/instances/jobmatch-vm" -> (known after apply)
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
      ~ tags_fingerprint          = "xEi19su0rvw=" -> (known after apply)
      ~ zone                      = "europe-west1-b" -> "europe-west9-a" # forces replacement
        # (9 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/job-match-v0/zones/europe-west1-b/disks/jobmatch-vm" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20251218" -> "ubuntu-os-cloud/ubuntu-2204-lts"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/job-match-v0/global/networks/jobmatch-vpc" -> (known after apply)
          ~ network_ip                  = "10.0.0.2" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet" -> (known after apply)
          ~ subnetwork_project          = "job-match-v0" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.140.169.214" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

  # google_compute_subnetwork.main must be replaced
-/+ resource "google_compute_subnetwork" "main" {
      ~ creation_timestamp         = "2025-12-29T07:00:10.903-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.0.0.1" -> (known after apply)
      ~ id                         = "projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
        name                       = "jobmatch-subnet"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/job-match-v0/global/networks/jobmatch-vpc" -> "projects/job-match-v0/global/networks/jobmatch-vpc"
      ~ private_ip_google_access   = false -> (known after apply)
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ region                     = "europe-west1" -> "europe-west9" # forces replacement
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/job-match-v0/regions/europe-west1/subnetworks/jobmatch-subnet" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_storage_bucket.backups must be replaced
-/+ resource "google_storage_bucket" "backups" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "jobmatch-backups-job-match-v0" -> (known after apply)
      ~ location                    = "EUROPE-WEST1" -> "EUROPE-WEST9" # forces replacement
        name                        = "jobmatch-backups-job-match-v0"
      ~ project_number              = 323309663680 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/jobmatch-backups-job-match-v0" -> (known after apply)
      ~ url                         = "gs://jobmatch-backups-job-match-v0" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ lifecycle_rule {
          - condition {
              - age                                     = 7 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
          + condition {
              + age                   = 7
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ lifecycle_rule {
          - condition {
              - age                                     = 30 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ lifecycle_rule {
          - condition {
              - age                                     = 90 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }

      - soft_delete_policy {
          - effective_time             = "2025-12-29T14:59:51.156Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

        # (1 unchanged block hidden)
    }

  # google_storage_bucket.bronze must be replaced
-/+ resource "google_storage_bucket" "bronze" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "jobmatch-bronze-job-match-v0" -> (known after apply)
      ~ location                    = "EUROPE-WEST1" -> "EUROPE-WEST9" # forces replacement
        name                        = "jobmatch-bronze-job-match-v0"
      ~ project_number              = 323309663680 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/jobmatch-bronze-job-match-v0" -> (known after apply)
      ~ url                         = "gs://jobmatch-bronze-job-match-v0" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ lifecycle_rule {
          - condition {
              - age                                     = 90 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ lifecycle_rule {
          - condition {
              - age                                     = 365 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
          + condition {
              + age                   = 365
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ lifecycle_rule {
          - condition {
              - age                                     = 0 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - no_age                                  = false -> null
              - num_newer_versions                      = 3 -> null
              - send_age_if_zero                        = true -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ARCHIVED" -> null
            }
          + condition {
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + send_age_if_zero      = true
              + with_state            = "ARCHIVED"
            }

            # (1 unchanged block hidden)
        }

      - soft_delete_policy {
          - effective_time             = "2025-12-29T14:59:51.750Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ bronze_bucket_url               = "gs://jobmatch-bronze-job-match-v0" -> (known after apply)
  ~ ssh_command                     = "gcloud compute ssh jobmatch-vm --zone=europe-west1-b --project=job-match-v0" -> "gcloud compute ssh jobmatch-vm --zone=europe-west9-a --project=job-match-v0"
  ~ static_ip                       = "34.140.169.214" -> (known after apply)
  ~ summary                         = <<-EOT
        ============================================================
        JobMatch V0 - Deployment Summary
        ============================================================
        
        VM Instance:
          Name:        jobmatch-vm
          External IP: 34.140.169.214
          Zone:        europe-west1-b
        
        SSH Command:
          gcloud compute ssh jobmatch-vm --zone=europe-west1-b --project=job-match-v0
        
        Storage:
          Bronze Bucket: jobmatch-bronze-job-match-v0
          Backups Bucket: jobmatch-backups-job-match-v0
        
        BigQuery:
          Silver Dataset: jobmatch_silver
          Gold Dataset:   jobmatch_gold
        
        GitHub Actions Secrets:
          GCP_PROJECT_ID:                  job-match-v0
          GCP_WORKLOAD_IDENTITY_PROVIDER:  projects/323309663680/locations/global/workloadIdentityPools/github-pool/providers/github-provider
          GCP_SERVICE_ACCOUNT:             terraform-sa@job-match-v0.iam.gserviceaccount.com
        
        Next Steps:
          1. Point your domain to 34.140.169.214
          2. SSH into the VM and deploy your application
          3. Configure Caddyfile with your domain for HTTPS
        
        ============================================================
    EOT -> (known after apply)
  ~ vm_external_ip                  = "34.140.169.214" -> (known after apply)
  ~ vm_internal_ip                  = "10.0.0.2" -> (known after apply)
  ~ vm_zone                         = "europe-west1-b" -> "europe-west9-a"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @MatthieuEngles, Action: `pull_request`*